Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/22/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-3qjRnW4ScRQZkt4m

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.grafana.helm_release.loki: Refreshing state... [id=loki]
module.kubernetes.module.storage-class.kubernetes_manifest.db-storage: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-namespace: Refreshing state...
module.kubernetes.module.storage-class.kubernetes_manifest.monitoring-storage: Refreshing state...
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.grafana.helm_release.promtail: Refreshing state... [id=promtail]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.loki will be destroyed
  - resource "helm_release" "loki" {
      - atomic                     = false -> null
      - chart                      = "loki" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "loki" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "2.9.2"
              - chart       = "loki"
              - name        = "loki"
              - namespace   = "grafana"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - backend = {
                          - affinity    = null
                          - persistence = {
                              - size         = "3Gi"
                              - storageClass = "monitoring-storage"
                            }
                        }
                      - read    = {
                          - affinity    = null
                          - persistence = {
                              - size         = "3Gi"
                              - storageClass = "monitoring-storage"
                            }
                        }
                      - write   = {
                          - affinity    = null
                          - persistence = {
                              - size         = "3Gi"
                              - storageClass = "monitoring-storage"
                            }
                        }
                    }
                )
              - version     = "5.35.0"
            },
        ] -> null
      - name                       = "loki" -> null
      - namespace                  = "grafana" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://grafana.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "failed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<-EOT
                write:
                  affinity:
                  persistence:
                    size: 3Gi
                    storageClass: monitoring-storage
                read:
                  affinity:
                  persistence:
                    size: 3Gi
                    storageClass: monitoring-storage
                backend:
                  affinity:
                  persistence:
                    size: 3Gi
                    storageClass: monitoring-storage
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "5.35.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.db-storage will be destroyed
  - resource "kubernetes_manifest" "db-storage" {
      - manifest = {
          - apiVersion        = "storage.k8s.io/v1"
          - kind              = "StorageClass"
          - metadata          = {
              - name = "db-storage"
            }
          - provisioner       = "kubernetes.io/no-provisioner"
          - reclaimPolicy     = "Delete"
          - volumeBindingMode = "WaitForFirstConsumer"
        } -> null
      - object   = {
          - allowVolumeExpansion = null
          - allowedTopologies    = null
          - apiVersion           = "storage.k8s.io/v1"
          - kind                 = "StorageClass"
          - metadata             = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "db-storage"
              - namespace                  = null
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - mountOptions         = null
          - parameters           = null
          - provisioner          = "kubernetes.io/no-provisioner"
          - reclaimPolicy        = "Delete"
          - volumeBindingMode    = "WaitForFirstConsumer"
        } -> null
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.local-storage-class will be created
  + resource "kubernetes_manifest" "local-storage-class" {
      + manifest = {
          + apiVersion        = "storage.k8s.io/v1"
          + kind              = "StorageClass"
          + metadata          = {
              + annotations = {
                  + "storageclass.kubernetes.io/is-default-class" = "true"
                }
              + name        = "local-storage-class"
            }
          + provisioner       = "kubernetes.io/no-provisioner"
          + reclaimPolicy     = "Delete"
          + volumeBindingMode = "WaitForFirstConsumer"
        }
      + object   = {
          + allowVolumeExpansion = (known after apply)
          + allowedTopologies    = (known after apply)
          + apiVersion           = "storage.k8s.io/v1"
          + kind                 = "StorageClass"
          + metadata             = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "local-storage-class"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + mountOptions         = (known after apply)
          + parameters           = (known after apply)
          + provisioner          = "kubernetes.io/no-provisioner"
          + reclaimPolicy        = "Delete"
          + volumeBindingMode    = "WaitForFirstConsumer"
        }
    }

  # module.kubernetes.module.storage-class.kubernetes_manifest.monitoring-storage will be destroyed
  - resource "kubernetes_manifest" "monitoring-storage" {
      - manifest = {
          - apiVersion        = "storage.k8s.io/v1"
          - kind              = "StorageClass"
          - metadata          = {
              - name = "monitoring-storage"
            }
          - provisioner       = "kubernetes.io/no-provisioner"
          - reclaimPolicy     = "Delete"
          - volumeBindingMode = "WaitForFirstConsumer"
        } -> null
      - object   = {
          - allowVolumeExpansion = null
          - allowedTopologies    = null
          - apiVersion           = "storage.k8s.io/v1"
          - kind                 = "StorageClass"
          - metadata             = {
              - annotations                = null
              - creationTimestamp          = null
              - deletionGracePeriodSeconds = null
              - deletionTimestamp          = null
              - finalizers                 = null
              - generateName               = null
              - generation                 = null
              - labels                     = null
              - managedFields              = null
              - name                       = "monitoring-storage"
              - namespace                  = null
              - ownerReferences            = null
              - resourceVersion            = null
              - selfLink                   = null
              - uid                        = null
            }
          - mountOptions         = null
          - parameters           = null
          - provisioner          = "kubernetes.io/no-provisioner"
          - reclaimPolicy        = "Delete"
          - volumeBindingMode    = "WaitForFirstConsumer"
        } -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>